import 'package:aanma_nalam/constant/app_theme.dart';
import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';
import 'package:flutter/widgets.dart';
import 'package:get/get.dart';


class PDFFiles extends StatefulWidget {
  const PDFFiles({super.key});

  @override
  State<PDFFiles> createState() => _PDFFilesState();
}

class _PDFFilesState extends State<PDFFiles> {


  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: PDFBookFiles(
        title: 'மத்தேயுவும் வாக்காலமும் இயேசு ஏறது அரசன் காலத்தில் பிறந்தார்',
        paragraphs: [
          'இயேசுவின் இளமை பருவமுற்று நற்செய்தித் செய்திகள் பல உள்ளன...',
          'என்று சொல்லு எவரும் இந்த கட்டுரையை படிக்க வேண்டாம்\n\n'
              'இறை இயேசுவின் அன்பிற்கினிய நண்பர்களே! '
              'இவ்வுலகில் உள்ள கடவுளின் படைப்புகளில் அதி உன்னதமான படைப்பு "மனிதன்". '
              'எல்லாவற்றையும் படைத்த பின்பு எல்லாம் நல்லது என்று கண்ட ஆண்டவர் (தொ.நூல் 1:31) '
              'முதல் மனிதனைப் படைத்த பின்பு அவன் தனிமையாய் இருப்பது நல்லது அல்ல என்று கண்டார் (தொ.நூல் 2:18) '
              'அவனுக்கு ஏற்ற துணையை உண்டாக்கி அது நல்லது என்று கண்டு தான் படைத்த யாவற்றையும் ஆண்டுகொள்ளும் அதிகாரத்தை அவர்களுக்குத் தந்தார் (தொ நூல் 1:28) '
              'இவ்விதமாக கடவுள் குடும்ப உறவை உண்டாக்கி, அவர்கள் குடும்பம் குடும்பமாகத்தான் வாழவேண்டும் என்று வழிவகுத்தார். '
              'அதனால்தான் ஆண்டவராகிய இயேசு கிறிஸ்து இவ்வுலகிற்கு வந்தபொழுது அன்னை மரியாள், யோசேப்பு என்கிற குடும்பத்தில் உதயமானார். (லூக்கா:1,2 அதிகாரங்கள்)\n\n'
              'கோபத்தினால் எத்தகைய பாதிப்புகள் நமது குடும்ப வாழ்வை சீரழிக்கிறது என்பதை அறிந்தால்தான் அதிலிருந்து மீண்டு வர முடியும்...',
          // Add more paragraphs as needed
          "மகிழ்ச்சியாய் இருக்கின்ற ஒரு குடும்பத்தில் இந்த \"கோபம்\" எத்தகைய சீரழிவுகளைக் கொண்டு வருகிறது என்று பார்க்கப் போகுகின்றோம். "
                                    "கோபத்தினால் எத்தகைய பாதிப்புகள் நமது குடும்ப வாழ்வை சீரழிக்கிறது என்பதை அறிந்தால்தான் அதிலிருந்து விடுபடுவதற்கு மனம் விரும்பும், "
                                    "விரும்பினால்தான் அதிலிருந்து மீண்டு வரமுடியும்.\n\n"
                                    "அங்கிங்கென்றில்லாதபடி எல்லா மனிதரிடத்திலும் நீக்கமற நிறைந்திருக்கும் இந்த \"கோபம்\" என்னென்ன பாதிப்புகளை நமது குடும்பங்களுக்குள் உண்டாக்குகிறது என்று ஆராய்வோம். "
                                    "இந்த கோபத்தை யாராலும் இல்லாமற் செய்ய முடியாது. இன்று கோபம் இல்லாமல் இருக்கலாம். நாளை வரும். நாளை கோபம் இல்லாமல் இருக்கலாம், நாளை மறுநாள் வரும். "
                                    "ஆதனால் ஆண்டவரும் \"கோபமே படாதீர்கள்\" என்று சொல்லாமல் \"சினங்கொள்ள தாமதியுங்கள்\" (யாக் 1:19) என்று நடைமுறைக்கு ஏற்றவாறு அறிவுரை வழங்குகின்றார். "
                                    "ஏன் சீக்கிரமாய் கோபப்படக்கூடாது ? அப்படி சீக்கிரமாகக் கோபப்பட்டால் என்னென்ன பாதிப்புகள் நடக்கும் என்று ஒவ்வொன்றாக பார்ப்போம்.\n\n"
                                    "முதல் பாதிப்பு\n"
                                    "உறவுகெடும்\n"
                                    "கோபத்தினால் வரும் முதல் பாதிப்பு, அது சகமனிதனோடு உள்ள உறவை முறித்துவிடும் உறவு கெடும். எதிர் வீட்டுக்காரரோடு பேசாமலும், "
                                    "அடுத்த வீட்டுக்காரரோடு ஆண்டுக்கணக்கில் பேசாமலும் இருப்போரை நாம் நன்கு அறிவோம். கணவனும் மனைவியும் ஆண்டுக்கணக்கில் பேசாமல் இருப்போர் இப்போதும் உண்டு. "
                                    "இன்றைக்கு நடக்கும் மணமுறிவுகளுக்கு முக்கிய காரணமே \"கோபம்தான்”. அதுவும் கிறிஸ்தவ குடும்பங்களில் தான் இத்தகைய மனமுறிவுகள் அதிகம் என்று ஒரு புள்ளி விவரம் சொல்லுகிறபோது "
                                    "மனது வலிக்கிறது. இவர்களை நினைத்து ஆண்டவர் எவ்வளவு வருத்தப்படுவார், மனவேதனை அடைவார். இந்த கோபம் சக மனிதனை அன்பு செய்ய முடியாதபடி மனித உறவுகளை கெடுத்துவிடுகிறது. "
                                    "அது மாத்திரமல்ல கடவுளுக்கும் நமக்கும் உள்ள உறவும் கெட்டுவிடுகிறது. \"கண்ணால் காண்கின்ற மனிதனை அன்பு செய்யாமல் கண்களால் காண முடியாத கடவுளை அன்பு செய்கிறேன் "
                                    "என்று ஒருவன் சொன்னால் அவன் பொய் சொல்லுகிறான்\" (1 யோவான் 4:20) என்று திருவிவிலியம் நம்மை எச்சரிக்கின்றது.\n\n"
                                    "ஆக \"கோபம்\" சக மனிதர்களுக்குள் இருக்கிற உறவை கெடுத்து விடுகிறது. அத்தோடு அது நில்லாமல் நமக்கும் கடவுளுக்கும் உள்ள உறவையும் கெடுத்துவிடுகிறது. "
                                    "ஆகவே, நல்லதொரு குடும்பமாய், பல்கலைக்கழகமாய், சாட்சியுள்ள குடும்பமாய் வாழ, ஆண்டவர் கூறுகிறபடி \"கோபம் படுவதற்கு தாமதிப்போம்\".\n\n"
                                    "இரண்டாவது பாதிப்பு\n"
                                    "ஜெபத்திற்கு தடை வரும்\n"
                                    "கோபத்தினால் வருகிற இரண்டாவது பாதிப்பு, \"உண்மையாய் ஜெபிக்க இயலாது\". ஏனெனில் பலிசெலுத்த வரும்பொழுது உன் சகோதரன் உன்மீது மனத்தாங்கல் அறிந்தால், "
                                    "இருப்பதை அர உன் காணிக்கைகளை பலிபீடத்தின் மீது வைத்துளீட்டு திரும்பிப் போய் உன் சகோதரனோடு சமாதானம் செய்துகொண்டு வந்தபிறகு உன் பலியைச் செலுத்து (மத் 5:23) "
                                    "என்று ஆண்டவராகிய இயேசு கூறுகிறார். சக மனிதரோடு கோபமாக இருக்கும் நம்முடைய ஜெபத்தை அவர் ஏற்கமாட்டார். மீறி நாம் செய்யும் ஜெபம் வீணானதாகவே இருக்கும். "
                                    "பரிசேயனைப் போன்று நம்முடைய ஜெபத்தைக் குறித்து நமக்கு நாமே பெருமைப்பட்டுக் கொள்ளலாம். ஆனால் ஆண்டவர், அதை அருவருத்துத் தள்ளுவார் (லூக்கா 18:14). "
                                    "கோபத்தை உள்ளே வைத்துக் கொண்டு அன்பின் ஆண்டவரை எப்படி ஆராதிக்க முடியும்? உண்மையில்லாத இந்த ஜெபத்திற்கு பரிசுத்த ஆவியானவரின் பரிந்து பேசுதல் எவ்வாறு கிடைக்கும்? "
                                    "(உரோ 8:26) பரிசுத்த ஆவியானவர் நம்மை ஆலயமாகத் தெரிந்து கொண்டுள்ளார். (1 கொ 6:19) ஆவியானவர் இருக்கும் இடத்தில் \"பகைக்கு\", \"கோபத்திற்கு\" இடமேது? "
                                    "அதனால்தான் \"சினங்கொள்ள தாமதியுங்கள்\"(யாக்1:19) என்று ஆண்டவர் கூறுகின்றார்.",


        ],
        imagePaths: [
          'assets/images/articlesimages/image7.jpg',
          'assets/images/articlesimages/image6.jpg',
          'assets/images/articlesimages/image5.jpg',
          // Add more image paths as needed
        ],
      ),
    );
  }
}











class PDFBookFiles extends StatefulWidget {
  final String title;
  final List<String> paragraphs;
  final List<String> imagePaths;

  const PDFBookFiles({
    super.key,
    required this.title,
    required this.paragraphs,
    required this.imagePaths,
  });

  @override
  State<PDFBookFiles> createState() => _PDFBookFilesState();
}

class _PDFBookFilesState extends State<PDFBookFiles> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: Column(
        children: [
          Container(
            width: Get.width,
            height: 50,
            color: AppTheme.corecolor,
          ),
          Column(
            children: [
              SizedBox(
                height: 20,
              ),
              Padding(
                padding: const EdgeInsets.only(left: 16.0),
                child: Row(
                  mainAxisAlignment: MainAxisAlignment.spaceBetween,
                  children: [
                    GestureDetector(
                      onTap: () {
                        Get.back();
                      },
                      child: Image.asset(
                        'assets/images/icons/Vector.png',
                        width: 15,
                        height: 15,
                      ),
                    ),
                  ],
                ),
              ),
            ],
          ),
          Expanded(
            child: SingleChildScrollView(
              child: Padding(
                padding: const EdgeInsets.only(
                    top: 35.0, left: 8, right: 8, bottom: 35),
                child: Container(
                  decoration: BoxDecoration(
                    color: AppTheme.yearbgcolor,
                    borderRadius: BorderRadius.circular(15.0),
                  ),
                  child: Padding(
                    padding: const EdgeInsets.all(16.0),
                    child: Column(
                      crossAxisAlignment: CrossAxisAlignment.start,
                      children: [
                        Text(
                          widget.title,
                          style: TextStyle(
                            fontSize: 16,
                            fontWeight: FontWeight.bold,
                          ),
                        ),
                        SizedBox(height: 20),
                        for (int i = 0; i < widget.imagePaths.length; i++) ...[
                          Image.asset(widget.imagePaths[i]),
                          SizedBox(height: 20),
                          if (i < widget.paragraphs.length)
                            Text(
                              widget.paragraphs[i],
                              style: TextStyle(
                                fontSize: 12,
                              ),
                            ),
                          SizedBox(height: 20),
                        ]
                      ],
                    ),
                  ),
                ),
              ),
            ),
          ),
        ],
      ),
    );
  }
}





